W4D5/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "tomato@yucky.com"], ["password_digest", "$2a$12$EGa.MoF6SNfIMNkyzoUp6eB1X170hYhZu4AM2jsRdVsMbu24eVW2q"], ["session_token", "tUoMKETzfUcUr46k__KRoA"]]
---
  def create
    # Create a new User object from the strong params
    @user = User.new(user_params)

    # Attempt to save this user to the database. If successful, login the user and redirect to its page.
    if @user.save